---
kind: type
id: T:Autodesk.Revit.DB.PolylineSegments
source: html/d268283e-28de-c419-5e1f-7a870603506c.htm
---
# Autodesk.Revit.DB.PolylineSegments

An output node that represents a tessellated polyline segments.

## Syntax (C#)
```csharp
public class PolylineSegments : IDisposable
```

## Remarks
See also: OnPolylineSegments(PolylineSegments) .